## Automatically generated; do not modify
## Edit 'ecevr_pinmap.py' instead and run gen_xdc.py
## This file was generated for board: EcEvrDevBoard
## using pin definitions for device : xc7z015clg485pkg.txt
##
create_generated_clock -name lan9254HBI_ALE -multiply_by 1 -source [all_fanin -flat -startpoints_only [get_ports {lan9254Pins[19]}]] [get_ports {lan9254Pins[19]}]
create_generated_clock -name lan9254HBI_WR -multiply_by 1 -source [all_fanin -flat -startpoints_only [get_ports {lan9254Pins[24]}]] [get_ports {lan9254Pins[24]}]
create_generated_clock -name lan9254HBI_RD -multiply_by 1 -source [all_fanin -flat -startpoints_only [get_ports {lan9254Pins[25]}]] [get_ports {lan9254Pins[25]}]
set_output_delay 0 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[19]}]
set_false_path -to   [get_ports {lan9254Pins[19]}]
set_output_delay 0 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[24]}]
set_false_path -to   [get_ports {lan9254Pins[24]}]
set_output_delay 0 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[25]}]
set_false_path -to   [get_ports {lan9254Pins[25]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {lan9254Pins[1]}]
set_false_path -to   [get_ports {lan9254Pins[1]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[4]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[4]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[4]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[4]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[4]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[4]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[4]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[4]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[5]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[5]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[5]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[5]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[5]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[5]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[5]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[5]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[8]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[8]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[8]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[8]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[8]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[8]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[8]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[8]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[9]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[9]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[9]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[9]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[9]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[9]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[9]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[9]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[10]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[10]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[10]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[10]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[10]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[10]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[10]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[10]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {lan9254Pins[11]}]
set_false_path -to   [get_ports {lan9254Pins[11]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[15]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[15]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[15]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[15]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[15]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[15]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[15]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[15]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[16]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[16]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[16]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[16]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[16]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[16]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[16]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[16]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[17]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[17]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[17]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[17]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[17]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[17]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[17]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[17]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[18]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[18]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[18]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[18]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[18]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[18]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[18]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[18]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[27]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[27]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[27]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[27]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[27]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[27]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[27]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[27]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {lan9254Pins[29]}]
set_false_path -to   [get_ports {lan9254Pins[29]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[34]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[34]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[34]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[34]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[34]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[34]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[34]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[34]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[35]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[35]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[35]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[35]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[35]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[35]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[35]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[35]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[36]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[36]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[36]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[36]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[36]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[36]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[36]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[36]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[37]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[37]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[37]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[37]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[37]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[37]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[37]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[37]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {lan9254Pins[38]}]
set_false_path -to   [get_ports {lan9254Pins[38]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[39]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[39]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[39]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[39]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[39]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[39]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[39]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[39]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[40]}]
set_output_delay -add_delay -min -0.100000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[40]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[40]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -add_delay -max 10.200000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[40]}]
set_output_delay -add_delay -min -5.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[40]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[40]}] -to [get_clocks lan9254HBI_ALE]
set_input_delay -add_delay -max 0.200000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[40]}]
set_input_delay -add_delay -min 0.000000 -clock [get_clocks {lan9254HBI_RD}] [get_ports {lan9254Pins[40]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {lan9254Pins[42]}]
set_false_path -to   [get_ports {lan9254Pins[42]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {lan9254Pins[43]}]
set_false_path -to   [get_ports {lan9254Pins[43]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {ledPins[0]}]
set_false_path -to   [get_ports {ledPins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {ledPins[1]}]
set_false_path -to   [get_ports {ledPins[1]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {ledPins[2]}]
set_false_path -to   [get_ports {ledPins[2]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {ledPins[3]}]
set_false_path -to   [get_ports {ledPins[3]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {ledPins[4]}]
set_false_path -to   [get_ports {ledPins[4]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {ledPins[5]}]
set_false_path -to   [get_ports {ledPins[5]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {ledPins[6]}]
set_false_path -to   [get_ports {ledPins[6]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {ledPins[7]}]
set_false_path -to   [get_ports {ledPins[7]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {ledPins[8]}]
set_false_path -to   [get_ports {ledPins[8]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {pwrCyclePin}]
set_false_path -to   [get_ports {pwrCyclePin}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {i2cSdaPins[0]}]
set_false_path -to   [get_ports {i2cSdaPins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {i2cSdaPins[1]}]
set_false_path -to   [get_ports {i2cSdaPins[1]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {i2cSclPins[0]}]
set_false_path -to   [get_ports {i2cSclPins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {i2cSclPins[1]}]
set_false_path -to   [get_ports {i2cSclPins[1]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {eepWPPin}]
set_false_path -to   [get_ports {eepWPPin}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {eepSz32kPin}]
set_false_path -to   [get_ports {eepSz32kPin}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {i2cISObPin}]
set_false_path -to   [get_ports {i2cISObPin}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {jumper7Pin}]
set_false_path -to   [get_ports {jumper7Pin}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {jumper8Pin}]
set_false_path -to   [get_ports {jumper8Pin}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {sfpLosPins[0]}]
set_false_path -to   [get_ports {sfpLosPins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {sfpPresentbPins[0]}]
set_false_path -to   [get_ports {sfpPresentbPins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {sfpTxFaultPins[0]}]
set_false_path -to   [get_ports {sfpTxFaultPins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]

set_false_path -from [get_ports {sfpTxEnPins[0]}]
set_false_path -to   [get_ports {sfpTxEnPins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
set_output_delay -add_delay -max 0.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min 100.000000 -clock [get_clocks {lan9254HBI_ALE}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_output_delay -add_delay -min -0.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[22]}]
set_multicycle_path -hold 1 -through [get_ports {lan9254Pins[22]}] -to [get_clocks lan9254HBI_WR]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[21]}]
set_output_delay -max -100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_output_delay -min 100.000000 -clock [get_clocks {lan9254HBI_WR}] [get_ports {lan9254Pins[20]}]
set_false_path -from [get_ports {lan9254Pins[0]}]
set_false_path -to   [get_ports {lan9254Pins[0]}]
